In [1]:
# import the sqlite library
import sqlite3

In [47]:
# helper functions here

In [2]:
# create the connection I will use to connection to the database
# the database should exist before running this, otherwise it will create an empty database
conn = sqlite3.connect('uni.db')

In [3]:
# we need a cursor so we can "move" through the database (i.e. use SQL statements and get/insert/update/delete data)
cursor = conn.cursor()

In [4]:
# do an initial SELECT to see ALL results in tables
cursor.execute("SELECT * FROM department")
print(cursor.fetchall())

cursor.execute("SELECT * FROM course")
print(cursor.fetchall())

cursor.execute("SELECT * FROM instructor")
print(cursor.fetchall())

cursor.execute("SELECT * FROM section")
print(cursor.fetchall())

cursor.execute("SELECT * FROM student")
print(cursor.fetchall())

cursor.execute("SELECT * FROM takes")
print(cursor.fetchall())

[('Biology', 'Watson', 90000.0), ('Comp. Sci.', 'Taylor', 100000.0), ('Elec. Eng.', 'Taylor', 85000.0), ('Finance', 'Painter', 120000.0), ('History', 'Painter', 50000.0), ('Music', 'Packard', 80000.0), ('Physics', 'Watson', 70000.0)]
[('BIO-101', 'Intro. to Biology', 'Biology', 4), ('BIO-301', 'Genetics', 'Biology', 4), ('BIO-399', 'Computational Biology', 'Biology', 3), ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4), ('CS-190', 'Game Design', 'Comp. Sci.', 4), ('CS-315', 'Robotics', 'Comp. Sci.', 3), ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3), ('CS-319', 'Image Processing', 'Comp. Sci.', 3), ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3), ('FIN-201', 'Investment Banking', 'Finance', 3), ('HIS-351', 'World History', 'History', 3), ('MU-199', 'Music Video Production', 'Music', 3), ('PHY-101', 'Physical Principles', 'Physics', 4), ('CS-001', 'Weekly Seminar', 'Comp. Sci.', 0)]
[(10101, 'Srinivasan', 'Comp. Sci.', 65000.0), (12121, 'Wu', 'Finance', 90000.0), (15151, 'Mozart', 'Music', 40000.0), (22222, 'Einstein', 'Physics', 95000.0), (32343, 'El Said', 'History', 60000.0), (33456, 'Gold', 'Physics', 87000.0), (45565, 'Katz', 'Comp. Sci.', 75000.0), (58583, 'Califieri', 'History', 62000.0), (76543, 'Singh', 'Finance', 80000.0), (76766, 'Crick', 'Biology', 72000.0), (83821, 'Brandt', 'Comp. Sci.', 92000.0), (98345, 'Kim', 'Elec. Eng.', 80000.0)]
[('BIO-101', 1, 'Summer', 2017, 'Painter', 514, 'B'), ('BIO-301', 1, 'Summer', 2018, 'Painter', 514, 'A'), ('CS-101', 1, 'Fall', 2017, 'Packard', 101, 'H'), ('CS-101', 1, 'Spring', 2018, 'Packard', 101, 'F'), ('CS-190', 1, 'Spring', 2017, 'Taylor', 3128, 'E'), ('CS-190', 2, 'Spring', 2017, 'Taylor', 3128, 'A'), ('CS-315', 1, 'Spring', 2018, 'Watson', 120, 'D'), ('CS-319', 1, 'Spring', 2018, 'Watson', 100, 'B'), ('CS-319', 2, 'Spring', 2018, 'Taylor', 3128, 'C'), ('CS-347', 1, 'Fall', 2017, 'Taylor', 3128, 'A'), ('EE-181', 1, 'Spring', 2017, 'Taylor', 3128, 'C'), ('FIN-201', 1, 'Spring', 2018, 'Packard', 101, 'B'), ('HIS-351', 1, 'Spring', 2018, 'Painter', 514, 'C'), ('MU-199', 1, 'Spring', 2018, 'Packard', 101, 'D'), ('PHY-101', 1, 'Fall', 2017, 'Watson', 100, 'A'), ('CS-001', 1, 'Fall', 2017, None, None, 'A')]
[(1, 'McSpadden', 'Comp. Sci.', 32), (2, 'Todd', 'Music', 100), (3, 'Walker', 'Comp. Sci.', 4), (4, 'Widick', 'Finance', 16), (5, 'Sams', 'Biology', 96)]
[(1, 'CS-101', 1, 'Fall', 2017, 'A'), (1, 'CS-315', 1, 'Spring', 2018, 'A'), (2, 'CS-315', 1, 'Spring', 2018, 'A'), (3, 'CS-101', 1, 'Spring', 2018, 'A'), (4, 'EE-181', 1, 'Spring', 2017, 'A'), (5, 'MU-199', 1, 'Spring', 2018, 'A'), (1, 'EE-181', 1, 'Spring', 2017, 'A'), (1, 'CS-001', 1, 'Fall', 2017, ''), (3, 'CS-001', 1, 'Fall', 2017, '')]

Find the ID and name of each student who has taken at least one Comp. Sci course; make sure there are no duplicate names in the result.

In [4]:
# now I can practice some selects!
sql = '''SELECT DISTINCT(student.name)
FROM student
JOIN takes ON student.ID = takes.ID
JOIN course on takes.course_id = course.course_id
WHERE course.dept_name = 'Comp. Sci.'
ORDER BY student.name DESC'''

cursor.execute(sql)
print(cursor.fetchall())

[('Walker',), ('Todd',), ('McSpadden',)]

Find the ID and name of each student who has not taken any course offered before 2017.

SELECT
   *
FROM
   Artists a
WHERE
   NOT EXISTS(
      SELECT
         1
      FROM
         Albums
      WHERE
         ArtistId = a.ArtistId
   )
ORDER BY Name;

In [5]:
sql = '''SELECT student.ID, student.name
FROM student
WHERE NOT EXISTS(
SELECT 1
FROM
takes
WHERE takes.year < 2018 AND takes.ID = student.ID)'''

cursor.execute(sql)
print(cursor.fetchall())

[(2, 'Todd'), (5, 'Sams')]

In [16]:
sql = '''
SELECT DISTINCT takes.ID, student.name
FROM
takes
JOIN student ON takes.ID = student.ID
WHERE takes.year < 2018 AND takes.ID = student.ID'''

cursor.execute(sql)
print(cursor.fetchall())

[(1, 'McSpadden'), (3, 'Walker'), (4, 'Widick')]

For each department, find the max salary of the instructors in that department. You may assume that every department has at least one instructor.

In [37]:
sql = '''SELECT dept_name, MAX(salary)
FROM instructor
GROUP BY dept_name'''

cursor.execute(sql)
print(cursor.fetchall())

[('Biology', 72000.0), ('Comp. Sci.', 92000.0), ('Elec. Eng.', 80000.0), ('Finance', 90000.0), ('History', 62000.0), ('Music', 40000.0), ('Physics', 95000.0)]

Part d: Find the lowest, across all departments, of the per-department maximum salary computes by the preceding query.

In [6]:
sql = '''SELECT MIN(salary), dept_name FROM 
(SELECT dept_name, MAX(salary) AS salary
FROM instructor
GROUP BY dept_name)
'''

cursor.execute(sql)
print(cursor.fetchall())

[(40000.0, 'Music')]

Create a new course “CS-001” titled “Weekly Seminar” with 0 credits.

In [42]:
# insert into the course table
sqlInsert = '''INSERT INTO course (course_id, title, dept_name, credits) 
VALUES ('CS-001', 'Weekly Seminar', 'Comp. Sci.',  0)''' 
cursor.execute(sqlInsert)

# do an initial SELECT to see results
cursor.execute("SELECT * FROM course")
print(cursor.fetchall())

[('BIO-101', 'Intro. to Biology', 'Biology', 4), ('BIO-301', 'Genetics', 'Biology', 4), ('BIO-399', 'Computational Biology', 'Biology', 3), ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4), ('CS-190', 'Game Design', 'Comp. Sci.', 4), ('CS-315', 'Robotics', 'Comp. Sci.', 3), ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3), ('CS-319', 'Image Processing', 'Comp. Sci.', 3), ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3), ('FIN-201', 'Investment Banking', 'Finance', 3), ('HIS-351', 'World History', 'History', 3), ('MU-199', 'Music Video Production', 'Music', 3), ('PHY-101', 'Physical Principles', 'Physics', 4), ('CS-001', 'Weekly Seminar', 'Comp. Sci.', 0)]

Create a section of this course in Fall 2017, with sec_id = 1, and with the location of the section not yet specified.

In [44]:
# insert into the section table
sqlInsert = '''INSERT INTO section (course_id, sec_id, semester, year, time_slot_id) 
VALUES ('CS-001', 1, 'Fall', 2017, 'A')'''
cursor.execute(sqlInsert)

# do an initial SELECT to see results
cursor.execute("SELECT * FROM section")
print(cursor.fetchall())

[('BIO-101', 1, 'Summer', 2017, 'Painter', 514, 'B'), ('BIO-301', 1, 'Summer', 2018, 'Painter', 514, 'A'), ('CS-101', 1, 'Fall', 2017, 'Packard', 101, 'H'), ('CS-101', 1, 'Spring', 2018, 'Packard', 101, 'F'), ('CS-190', 1, 'Spring', 2017, 'Taylor', 3128, 'E'), ('CS-190', 2, 'Spring', 2017, 'Taylor', 3128, 'A'), ('CS-315', 1, 'Spring', 2018, 'Watson', 120, 'D'), ('CS-319', 1, 'Spring', 2018, 'Watson', 100, 'B'), ('CS-319', 2, 'Spring', 2018, 'Taylor', 3128, 'C'), ('CS-347', 1, 'Fall', 2017, 'Taylor', 3128, 'A'), ('EE-181', 1, 'Spring', 2017, 'Taylor', 3128, 'C'), ('FIN-201', 1, 'Spring', 2018, 'Packard', 101, 'B'), ('HIS-351', 1, 'Spring', 2018, 'Painter', 514, 'C'), ('MU-199', 1, 'Spring', 2018, 'Packard', 101, 'D'), ('PHY-101', 1, 'Fall', 2017, 'Watson', 100, 'A'), ('CS-001', 1, 'Fall', 2017, None, None, 'A')]

Enroll every student in the Comp. Sci department in the above section.

In [55]:
# insert into the takes table all Comp. Sci. students in
sqlInsert = '''INSERT INTO takes (ID, course_id, sec_id, semester, year, grade)
SELECT student.ID, 'CS-001', 1, 'Fall', 2017, ''
FROM student
WHERE student.dept_name = 'Comp. Sci.'
'''
cursor.execute(sqlInsert)

conn.commit()

# do an initial SELECT to see results
cursor.execute("SELECT * FROM takes")
print(cursor.fetchall())

#INSERT INTO queue (TransKey, CreateDateTime, Transmitted) 
#  SELECT Id, '2013-12-19T19:47:33',  0 
#  FROM trans WHERE Id != (SELECT TransKey from queue)

[(1, 'CS-101', 1, 'Fall', 2017, 'A'), (1, 'CS-315', 1, 'Spring', 2018, 'A'), (2, 'CS-315', 1, 'Spring', 2018, 'A'), (3, 'CS-101', 1, 'Spring', 2018, 'A'), (4, 'EE-181', 1, 'Spring', 2017, 'A'), (5, 'MU-199', 1, 'Spring', 2018, 'A'), (1, 'EE-181', 1, 'Spring', 2017, 'A'), (1, 'CS-001', 1, 'Fall', 2017, ''), (3, 'CS-001', 1, 'Fall', 2017, '')]

In [56]:
sqlDelete = '''DELETE FROM takes 
WHERE ID = 12345 AND course_id = 'CS-001' AND sec_id = 1 AND semester = 'Fall' AND year = 2017'''
cursor.execute(sqlDelete)

# do a SELECT to see results
cursor.execute("SELECT * FROM takes")
print(cursor.fetchall())

[(1, 'CS-101', 1, 'Fall', 2017, 'A'), (1, 'CS-315', 1, 'Spring', 2018, 'A'), (2, 'CS-315', 1, 'Spring', 2018, 'A'), (3, 'CS-101', 1, 'Spring', 2018, 'A'), (4, 'EE-181', 1, 'Spring', 2017, 'A'), (5, 'MU-199', 1, 'Spring', 2018, 'A'), (1, 'EE-181', 1, 'Spring', 2017, 'A'), (1, 'CS-001', 1, 'Fall', 2017, ''), (3, 'CS-001', 1, 'Fall', 2017, '')]

Delete all takes tuples corresponding to any section of any course with the word “advanced” as a part of the title; ignore case when matching the word with the title.

In [58]:
sqlDelete = '''DELETE FROM takes
WHERE EXISTS
  ( SELECT *
    FROM takes
    JOIN course ON takes.course_id = course.course_id
    WHERE course.title LIKE '%advanced%' )
'''
cursor.execute(sqlDelete)

# do a SELECT to see results
cursor.execute("SELECT * FROM takes")
print(cursor.fetchall())

[(1, 'CS-101', 1, 'Fall', 2017, 'A'), (1, 'CS-315', 1, 'Spring', 2018, 'A'), (2, 'CS-315', 1, 'Spring', 2018, 'A'), (3, 'CS-101', 1, 'Spring', 2018, 'A'), (4, 'EE-181', 1, 'Spring', 2017, 'A'), (5, 'MU-199', 1, 'Spring', 2018, 'A'), (1, 'EE-181', 1, 'Spring', 2017, 'A'), (1, 'CS-001', 1, 'Fall', 2017, ''), (3, 'CS-001', 1, 'Fall', 2017, '')]

In [55]:
# housekeeping
conn.commit()
cursor.close()
conn.close()